<?php

//
// Configuration file for plugin
//

// Protect against hack attempts
if (!defined('NGCMS')) die ('HAL');

// Preload config file
pluginsLoadConfig();

// Load lang files
LoadPluginLang($plugin, 'config', '', '', ':');

// Prepare configuration parameters
if(empty(pluginGetVariable($plugin, 'site_exists'))) {
    if (is_array($row = $mysql->select("SELECT reg FROM ".prefix."_users WHERE id = '1' limit 1"))) {
        $dReg = date('d.m.Y', $row[0]['reg']);
    } else {
        $dReg = date('d.m.Y', time());
    }
}

// Fill configuration parameters
$cfg = array();
array_push($cfg, array(
    'descr' => $lang[$plugin.':description'],
    ));

$cfgX = array();
    array_push($cfgX, array(
        'name' => 'outNW',
        'title' => 'Р вЂ™ РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р С•РЎвЂљРЎРѓРЎС“РЎвЂљРЎРѓРЎвЂљР Р†Р С‘РЎРЏ Р С�Р В°РЎвЂљР ВµРЎР‚Р С‘Р В°Р В»Р С•Р Р† Р Р†РЎвЂ№Р Р†Р С•Р Т‘Р С‘РЎвЂљРЎРЉ РЎвЂ Р С‘РЎвЂћРЎР‚РЎвЂ№ Р С‘Р В»Р С‘ РЎРѓР В»Р С•Р Р†Р В°',
        'descr' => 'Р С›РЎвЂљР С�Р ВµРЎвЂљРЎРЉРЎвЂљР Вµ РЎвЂЎРЎвЂљР С• Р С—Р С‘РЎРѓР В°РЎвЂљРЎРЉ Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р ВµРЎРѓР В»Р С‘ Р С—Р С• Р С•Р С—РЎР‚Р ВµР Т‘Р ВµР В»Р ВµР Р…Р Р…Р С•Р в„– Р С—Р С•Р В·Р С‘РЎвЂ Р С‘Р С‘ Р С�Р В°РЎвЂљР ВµРЎР‚Р С‘Р В°Р В»Р С•Р Р† Р Р…Р Вµ Р С•Р В±Р Р…Р В°РЎР‚РЎС“Р В¶Р С‘РЎвЂљРЎРѓРЎРЏ',
        'type' => 'select',
        'values' => array ( '0' => 'РЎвЂ Р С‘РЎвЂћРЎР‚РЎвЂ№', '1' => 'РЎРѓР В»Р С•Р Р†Р В°'),
        'value' => pluginGetVariable($plugin, 'outNW'),
        ));
    array_push($cfgX, array(
        'name' => 'site_exists',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Т‘Р Р…Р ВµР в„– РЎРѓРЎС“РЎвЂ°Р ВµРЎРѓРЎвЂљР Р†Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ РЎРѓР В°Р в„–РЎвЂљР В°',
        'descr' => 'Р Р€Р С”Р В°Р В¶Р С‘РЎвЂљР Вµ Р Т‘Р В°РЎвЂљРЎС“ РЎРѓР С•Р В·Р Т‘Р В°Р Р…Р С‘РЎРЏ РЎРѓР В°Р в„–РЎвЂљР В° Р Р† РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂљР Вµ <b>dd.mm.YYYY</b> Р С‘Р В»Р С‘ Р С•РЎРѓРЎвЂљР В°Р Р†РЎРЉРЎвЂљР Вµ Р С—Р С•Р В»Р Вµ Р С—РЎС“РЎРѓРЎвЂљРЎвЂ№Р С�, Р ВµРЎРѓР В»Р С‘ Р Р…Р Вµ РЎвЂ¦Р С•РЎвЂљР С‘РЎвЂљР Вµ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°РЎвЂљРЎРЉ РЎРЊРЎвЂљРЎС“ Р С‘Р Р…РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂ Р С‘РЎР‹',
        'type' => 'input',
        'html_flags' => 'placeholder="'.$dReg.'"',
        'value' => pluginGetVariable($plugin, 'site_exists') ? pluginGetVariable($plugin, 'site_exists') : $dReg,
        ));
array_push($cfg, array(
	'mode' => 'group',
	'title' => $lang[$plugin.':group.config'],
	'entries' => $cfgX,
	));

$cfgX = array();
    array_push($cfgX, array(
        'name' => 'static',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘РЎвЂ¦ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ ',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘РЎвЂ¦ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ ',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin, 'static'),
        ));
    array_push($cfgX, array(
        'name' => 'category',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin, 'category'),
        ));
    array_push($cfgX, array(
        'name' => 'news',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin, 'news'),
        ));
    array_push($cfgX, array(
        'name' => 'news_na',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р ВµР С•Р С—РЎС“Р В±Р В»Р С‘Р С”Р С•Р Р†Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р ВµР С•Р С—РЎС“Р В±Р В»Р С‘Р С”Р С•Р Р†Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'news_na'),
        ));
    if (getPluginStatusActive('comments')) {
        array_push($cfgX, array(
            'name' => 'comments',
            'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р С”Р С•Р С�Р С�Р ВµР Р…РЎвЂљР В°РЎР‚Р С‘Р ВµР Р†',
            'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р С”Р С•Р С�Р С�Р ВµР Р…РЎвЂљР В°РЎР‚Р С‘Р ВµР Р†',
            'type' => 'checkbox',
            'value' => pluginGetVariable($plugin,'comments'),
            ));
    }
    array_push($cfgX, array(
        'name' => 'images',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р С–РЎР‚РЎС“Р В¶Р ВµР Р…Р Р…РЎвЂ№РЎвЂ¦ Р С‘Р В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘Р в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р С–РЎР‚РЎС“Р В¶Р ВµР Р…Р Р…РЎвЂ№РЎвЂ¦ Р С‘Р В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘Р в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'images'),
        ));
    array_push($cfgX, array(
        'name' => 'files',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р С–РЎР‚РЎС“Р В¶Р ВµР Р…Р Р…РЎвЂ№РЎвЂ¦ РЎвЂћР В°Р в„–Р В»Р С•Р Р†',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р С–РЎР‚РЎС“Р В¶Р ВµР Р…Р Р…РЎвЂ№РЎвЂ¦ РЎвЂћР В°Р в„–Р В»Р С•Р Р†',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'files'),
        ));
    array_push($cfgX, array(
        'name' => 'users',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°РЎР‚Р ВµР С–Р ВµРЎРѓРЎвЂљРЎР‚Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°РЎР‚Р ВµР С–Р ВµРЎРѓРЎвЂљРЎР‚Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'users'),
        ));
    array_push($cfgX, array(
        'name' => 'users_na',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р ВµР В°Р С”РЎвЂљР С‘Р Р†Р Р…РЎвЂ№РЎвЂ¦ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р ВµР В°Р С”РЎвЂљР С‘Р Р†Р Р…РЎвЂ№РЎвЂ¦ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'users_na'),
        ));
    array_push($cfgX, array(
        'name' => 'ipban',
        'title' => 'Р СџР С•Р Т‘РЎРѓРЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В±Р В°Р Р…Р С•Р Р† Р С—Р С• Р В°Р в„–Р С—Р С‘',
        'descr' => 'Р вЂўРЎРѓР В»Р С‘ Р вЂ™РЎвЂ№ Р С—Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С–Р В°Р В»Р С•РЎвЂЎР С”РЎС“, РЎвЂљР С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р†РЎвЂ№Р Р†Р ВµР Т‘Р ВµРЎвЂљ Р С”Р С•Р В»РЎвЂЎР С‘Р ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р В±Р В°Р Р…Р ВµР Р…Р Р…РЎвЂ№РЎвЂ¦ Р С—Р С• Р В°Р в„–Р С—Р С‘',
        'type' => 'checkbox',
        'value' => pluginGetVariable($plugin,'ipban'),
        ));
    array_push($cfgX, array(
        'name' => 'cache',
        'title' => $lang[$plugin.':cache'],
        'descr' => $lang[$plugin.':cache#desc'],
        'type' => 'select',
        'values' => array('0' => $lang['noa'], '1' => $lang['yesa']),
        'value' => pluginGetVariable($plugin, 'cache'),
        ));
    array_push($cfgX, array(
        'name' => 'cacheExpire',
        'title' => $lang[$plugin.':cacheExpire'],
        'descr' => $lang[$plugin.':cacheExpire#desc'],
        'type' => 'input',
        'value' => intval(pluginGetVariable($plugin, 'cacheExpire')) ? intval(pluginGetVariable($plugin, 'cacheExpire')) : 86400,
        ));
array_push($cfg,  array(
    'mode' => 'group',
    'title' => 'Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С•Р В±РЎвЂ°Р ВµР в„– РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎРѓРЎвЂљР С‘Р С”Р С‘ РЎРѓР В°Р в„–РЎвЂљР В°',
    'toggle' => '1',
    'toggle.mode' => 'hide',
    'entries' => $cfgX,
    ));

$cfgX = array();
    array_push($cfgX, array(
        'name' => 'last_time',
        'title' => 'Р СџР ВµРЎР‚Р С‘Р С•Р Т‘ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р С•Р Р…Р В»Р В°Р в„–Р Р… РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎРѓРЎвЂљР С‘Р С”Р С‘ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
        'descr' => 'Р В§Р ВµРЎР‚Р ВµР В· РЎРѓР С”Р С•Р В»РЎРЉР С”Р С• РЎРѓР ВµР С”РЎС“Р Р…Р Т‘ Р С—РЎР‚Р С•Р С‘РЎРѓРЎвЂ¦Р С•Р Т‘Р С‘РЎвЂљ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р С•Р Р…Р В»Р В°Р в„–Р Р… РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎРѓРЎвЂљР С‘Р С”Р С‘ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–. Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>500</b> РЎРѓР ВµР С”.',
        'type' => 'input',
        'value' => intval(pluginGetVariable($plugin, 'last_time')) ? intval(pluginGetVariable($plugin, 'last_time')) : 500,
        ));
array_push($cfg,  array(
    'mode' => 'group',
    'title' => 'Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С•Р Р…Р В»Р В°Р в„–Р Р… РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎРѓРЎвЂљР С‘Р С”Р С‘ Р С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»Р ВµР в„–',
    'toggle' => '1',
    'toggle.mode' => 'hide',
    'entries' => $cfgX,
    ));

$cfgX = array();
    array_push($cfgX, array(
        'name' => 'localsource',
        'title' => $lang[$plugin.':localsource'],
        'descr' => $lang[$plugin.':localsource#descr'],
        'type' => 'select',
        'values' => array(
            '0' => $lang[$plugin.':localsource_0'],
            '1' => $lang[$plugin.':localsource_1'],
            ),
        'value' => intval(pluginGetVariable($plugin, 'localsource')) ? intval(pluginGetVariable($plugin, 'localsource')) : 1,
        ));
array_push($cfg, array(
    'mode' => 'group',
    'title' => $lang[$plugin.':group.source'],
    'entries' => $cfgX,
    ));

// RUN
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}
