if (typeof (WBBLANG)=="undefined") {WBBLANG = {};}
WBBLANG['ru']= CURLANG = {
	bold: "Р СџР С•Р В»РЎС“Р В¶Р С‘РЎР‚Р Р…РЎвЂ№Р в„–",
	italic: "Р С™РЎС“РЎР‚РЎРѓР С‘Р Р†",
	underline: "Р СџР С•Р Т‘РЎвЂЎР ВµРЎР‚Р С”Р Р…РЎС“РЎвЂљРЎвЂ№Р в„–",
	strike: "Р вЂ”Р В°РЎвЂЎР ВµРЎР‚Р С”Р Р…РЎС“РЎвЂљРЎвЂ№Р в„–",
	link: "Р РЋРЎРѓРЎвЂ№Р В»Р С”Р В°",
	img: "Р пїЅР В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘Р Вµ",
	sup: "Р СњР В°Р Т‘РЎРѓРЎвЂљРЎР‚Р С•РЎвЂЎР Р…РЎвЂ№Р в„– РЎвЂљР ВµР С”РЎРѓРЎвЂљ",
	sub: "Р СџР С•Р Т‘РЎРѓРЎвЂљРЎР‚Р С•РЎвЂЎР Р…РЎвЂ№Р в„– РЎвЂљР ВµР С”РЎРѓРЎвЂљ",
	justifyleft: "Р СћР ВµР С”РЎРѓРЎвЂљ Р С—Р С• Р В»Р ВµР Р†Р С•Р С�РЎС“ Р С”РЎР‚Р В°РЎР‹",
	justifycenter: "Р СћР ВµР С”РЎРѓРЎвЂљ Р С—Р С• РЎвЂ Р ВµР Р…РЎвЂљРЎР‚РЎС“",
	justifyright: "Р СћР ВµР С”РЎРѓРЎвЂљ Р С—Р С• Р С—РЎР‚Р В°Р Р†Р С•Р С�РЎС“ Р С”РЎР‚Р В°РЎР‹",
	table: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎС“",
	bullist: "Р С›Р В±РЎвЂ№РЎвЂЎР Р…РЎвЂ№Р в„– РЎРѓР С—Р С‘РЎРѓР С•Р С”",
	numlist: "Р СњРЎС“Р С�Р ВµРЎР‚Р С•Р Р†Р В°Р Р…Р Р…РЎвЂ№Р в„– РЎРѓР С—Р С‘РЎРѓР С•Р С”",
	quote: "Р В¦Р С‘РЎвЂљР В°РЎвЂљР В°",
	offtop: "Р С›РЎвЂћРЎвЂћРЎвЂљР С•Р С—",
	code: "Р С™Р С•Р Т‘",
	spoiler: "Р РЋР Р†Р С•РЎР‚Р В°РЎвЂЎР С‘Р Р†Р В°Р ВµР С�РЎвЂ№Р в„– РЎвЂљР ВµР С”РЎРѓРЎвЂљ",
	fontcolor: "Р В¦Р Р†Р ВµРЎвЂљ РЎвЂљР ВµР С”РЎРѓРЎвЂљР В°",
	fontsize: "Р В Р В°Р В·Р С�Р ВµРЎР‚ РЎвЂљР ВµР С”РЎРѓРЎвЂљР В°",
	fontfamily: "Р РЃРЎР‚Р С‘РЎвЂћРЎвЂљ РЎвЂљР ВµР С”РЎРѓРЎвЂљР В°",
	fs_verysmall: "Р С›РЎвЂЎР ВµР Р…РЎРЉ Р С�Р В°Р В»Р ВµР Р…РЎРЉР С”Р С‘Р в„–",
	fs_small: "Р СљР В°Р В»Р ВµР Р…РЎРЉР С”Р С‘Р в„–",
	fs_normal: "Р СњР С•РЎР‚Р С�Р В°Р В»РЎРЉР Р…РЎвЂ№Р в„–",
	fs_big: "Р вЂ�Р С•Р В»РЎРЉРЎв‚¬Р С•Р в„–",
	fs_verybig: "Р С›РЎвЂЎР ВµР Р…РЎРЉ Р В±Р С•Р В»РЎРЉРЎв‚¬Р С•Р в„–",
	smilebox: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ РЎРѓР С�Р В°Р в„–Р В»",
	video: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ Р Р†Р С‘Р Т‘Р ВµР С•",
	removeFormat: "Р Р€Р Т‘Р В°Р В»Р С‘РЎвЂљРЎРЉ РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂљР С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ",
	
	modal_link_title: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ РЎРѓРЎРѓРЎвЂ№Р В»Р С”РЎС“",
	modal_link_text: "Р С›РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµР С�РЎвЂ№Р в„– РЎвЂљР ВµР С”РЎРѓРЎвЂљ",
	modal_link_url: "URL РЎРѓРЎРѓРЎвЂ№Р В»Р С”Р С‘",
	modal_email_text: "Р С›РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµР С�РЎвЂ№Р в„– РЎРЊР В».Р В°Р Т‘РЎР‚Р ВµРЎРѓ",
	modal_email_url: "Email",
	modal_link_tab1: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ URL",
	
	modal_img_title: "Р вЂ™РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљРЎРЉ Р С‘Р В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘Р Вµ",
	modal_img_tab1: "Р вЂ™Р Р†Р ВµРЎРѓРЎвЂљР С‘ URL",
	modal_img_tab2: "Р вЂ”Р В°Р С–РЎР‚РЎС“Р В·Р С‘РЎвЂљРЎРЉ РЎвЂћР В°Р в„–Р В»",
	modal_imgsrc_text: "Р вЂ™Р Р†Р ВµР Т‘Р С‘РЎвЂљР Вµ Р В°Р Т‘РЎР‚Р ВµРЎРѓ Р С‘Р В·Р С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ",
	modal_img_btn: "Р вЂ™РЎвЂ№Р В±Р ВµРЎР‚Р С‘РЎвЂљР Вµ РЎвЂћР В°Р в„–Р В» Р Т‘Р В»РЎРЏ Р В·Р В°Р С–РЎР‚РЎС“Р В·Р С”Р С‘",
	add_attach: "Р вЂќР С•Р В±Р В°Р Р†Р С‘РЎвЂљРЎРЉ Р Р†Р В»Р С•Р В¶Р ВµР Р…Р С‘Р Вµ",
	
	modal_video_text: "Р вЂ™Р Р†Р ВµР Т‘Р С‘РЎвЂљР Вµ URL Р Р†Р С‘Р Т‘Р ВµР С•",
	
	close: "Р вЂ”Р В°Р С”РЎР‚РЎвЂ№РЎвЂљРЎРЉ",
	save: "Р РЋР С•РЎвЂ¦РЎР‚Р В°Р Р…Р С‘РЎвЂљРЎРЉ",
	cancel: "Р С›РЎвЂљР С�Р ВµР Р…Р В°",
	remove: "Р Р€Р Т‘Р В°Р В»Р С‘РЎвЂљРЎРЉ",
	
	validation_err: "Р вЂ™Р Р†Р ВµР Т‘Р ВµР Р…Р Р…РЎвЂ№Р Вµ Р Т‘Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р Р…Р ВµР С”Р С•РЎР‚РЎР‚Р ВµР С”РЎвЂљР Р…РЎвЂ№",
	error_onupload: "Р С›РЎв‚¬Р С‘Р В±Р С”Р В° Р Р†Р С• Р Р†РЎР‚Р ВµР С�РЎРЏ Р В·Р В°Р С–РЎР‚РЎС“Р В·Р С”Р С‘ РЎвЂћР В°Р в„–Р В»Р В° Р С‘Р В»Р С‘ РЎвЂљР В°Р С”Р С•Р Вµ РЎР‚Р В°РЎРѓРЎв‚¬Р С‘РЎР‚Р ВµР Р…Р С‘Р Вµ РЎвЂћР В°Р в„–Р В»Р В° Р Р…Р Вµ Р С—Р С•Р Т‘Р Т‘Р ВµРЎР‚Р В¶Р С‘Р Р†Р В°Р ВµРЎвЂљРЎРѓРЎРЏ",
	
	fileupload_text1: "Р СџР ВµРЎР‚Р ВµРЎвЂљР В°РЎвЂ°Р С‘РЎвЂљР Вµ РЎвЂћР В°Р в„–Р В» РЎРѓРЎР‹Р Т‘Р В°",
	fileupload_text2: "Р С‘Р В»Р С‘",
	
	loading: "Р вЂ”Р В°Р С–РЎР‚РЎС“Р В·Р С”Р В°",
	auto: "Р С’Р Р†РЎвЂљР С•",
	views: "Р СџРЎР‚Р С•РЎРѓР С�Р С•РЎвЂљРЎР‚Р С•Р Р†",
	downloads: "Р РЋР С”Р В°РЎвЂЎР С‘Р Р†Р В°Р Р…Р С‘Р в„–",
	
	//smiles
	sm1: "Р Р€Р В»РЎвЂ№Р В±Р С”Р В°",
	sm2: "Р РЋР С�Р ВµРЎвЂ¦",
	sm3: "Р СџР С•Р Т‘Р С�Р С‘Р С–Р С‘Р Р†Р В°Р Р…Р С‘Р Вµ",
	sm4: "Р РЋР С—Р В°РЎРѓР С‘Р В±Р С•, Р С”Р В»Р В°РЎРѓРЎРѓ",
	sm5: "Р В РЎС“Р С–Р В°РЎР‹",
	sm6: "Р РЃР С•Р С”",
	sm7:"Р вЂ”Р В»Р С•Р в„–",
	sm8: "Р С›Р С–Р С•РЎР‚РЎвЂЎР ВµР Р…Р С‘Р Вµ",
	sm9: "Р СћР С•РЎв‚¬Р Р…Р С‘РЎвЂљ"
	
	
};