<?php
// Protect against hack attempts
if (!defined('NGCMS')) die ('HAL');
//
// Configuration file for plugin
//
// Preload config file
plugins_load_config();
$xfEnclosureValues = array('' => '');
//
// IF plugin 'XFIELDS' is enabled - load it to prepare `enclosure` integration
if (getPluginStatusActive('xfields')) {
	include_once(root . "/plugins/xfields/xfields.php");
	// Load XFields config
	if (is_array($xfc = xf_configLoad())) {
		foreach ($xfc['news'] as $fid => $fdata) {
			$xfEnclosureValues[$fid] = $fid . ' (' . $fdata['title'] . ')';
		}
	}
}
// For example - find 1st category with news for demo URL
$demoCategory = '';
foreach ($catz as $scanCat) {
	if ($scanCat['posts'] > 0) {
		$demoCategory = $scanCat['alt'];
		break;
	}
}
// Fill configuration parameters
$cfg = array();
$cfgX = array();
array_push($cfg, array('descr' => '<b>Р СџР В»Р В°Р С–Р С‘Р Р… РЎРЊР С”РЎРѓР С—Р С•РЎР‚РЎвЂљР В° Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Р† РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂљР Вµ RSS</b><br>Р СџР С•Р В»Р Р…Р В°РЎРЏ Р В»Р ВµР Р…РЎвЂљР В° Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р В° Р С—Р С• Р В°Р Т‘РЎР‚Р ВµРЎРѓРЎС“: <b>' . generatePluginLink('rss_export', '', array(), array(), true, true) . (($demoCategory != '') ? '<br/>Р вЂєР ВµР Р…РЎвЂљР В° Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р В»РЎРЏ Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р С‘ <i>' . $catz[$demoCategory]['name'] . '</i>: ' . generatePluginLink('rss_export', 'category', array('category' => $demoCategory), array(), true, true) : '')));
array_push($cfgX, array('type' => 'select', 'name' => 'feed_title_format', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В°РЎвЂљ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р В»Р ВµР Р…РЎвЂљРЎвЂ№ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–', 'descr' => '<b>Р РЋР В°Р в„–РЎвЂљ</b> - Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” РЎРѓР В°Р в„–РЎвЂљР В°<br><b>Р РЋР В°Р в„–РЎвЂљ+Р С™Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘РЎРЏ</b> - Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” РЎРѓР В°Р в„–РЎвЂљР В°+Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р С‘ (Р С—РЎР‚Р С‘ Р Р†РЎвЂ№Р Р†Р С•Р Т‘Р Вµ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р С‘Р В· Р С”Р С•Р Р…Р С”РЎР‚Р ВµРЎвЂљР Р…Р С•Р в„– Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р С‘)<br><b>Р В РЎС“РЎвЂЎР Р…Р С•Р в„–</b> - Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” Р С•Р С—РЎР‚Р ВµР Т‘Р ВµР В»РЎРЏР ВµРЎвЂљРЎРѓРЎРЏ Р вЂ™Р В°Р С�Р С‘', 'values' => array('site' => 'Р РЋР В°Р в„–РЎвЂљ', 'site_title' => 'Р РЋР В°Р в„–РЎвЂљ+Р С™Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘РЎРЏ', 'handy' => 'Р В РЎС“РЎвЂЎР Р…Р С•Р в„–'), value => pluginGetVariable('rss_export', 'feed_title_format')));
array_push($cfgX, array('type' => 'input', 'name' => 'feed_title_value', 'title' => 'Р вЂ™Р В°РЎв‚¬ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” Р В»Р ВµР Р…РЎвЂљРЎвЂ№ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–', 'descr' => 'Р вЂ”Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р Р†РЎвЂ№Р В±Р С•РЎР‚Р В° РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂљР В° <b>"РЎР‚РЎС“РЎвЂЎР Р…Р С•Р в„–"</b> Р Р† Р С”Р В°РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р Вµ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р В»Р ВµР Р…РЎвЂљРЎвЂ№', 'html_flags' => 'style="width: 250px;"', 'value' => pluginGetVariable('rss_export', 'feed_title_value')));
array_push($cfgX, array('type' => 'select', 'name' => 'news_title', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В°РЎвЂљ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘', 'descr' => '<b>Р СњР В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ</b> - Р Р† Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р Вµ РЎС“Р С”Р В°Р В·РЎвЂ№Р Р†Р В°Р ВµРЎвЂљРЎРѓРЎРЏ РЎвЂљР С•Р В»РЎРЉР С”Р С• Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘<br><b>Р С™Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘РЎРЏ :: Р СњР В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ</b> - Р вЂ™ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р Вµ РЎС“Р С”Р В°Р В·РЎвЂ№Р Р†Р В°Р ВµРЎвЂљРЎРѓРЎРЏ Р С”Р В°Р С” Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘РЎРЏ РЎвЂљР В°Р С” Р С‘ Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘', 'values' => array('0' => 'Р СњР В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ', '1' => 'Р С™Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘РЎРЏ :: Р СњР В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ'), value => pluginGetVariable('rss_export', 'news_title')));
array_push($cfgX, array('type' => 'input', 'name' => 'news_count', 'title' => 'Р С™Р С•Р В»-Р Р†Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р В»РЎРЏ Р С—РЎС“Р В±Р В»Р С‘Р С”Р В°РЎвЂ Р С‘Р С‘ Р Р† Р В»Р ВµР Р…РЎвЂљР Вµ', value => pluginGetVariable('rss_export', 'news_count')));
array_push($cfgX, array('type' => 'select', 'name' => 'use_hide', 'title' => 'Р С›Р В±РЎР‚Р В°Р В±Р В°РЎвЂљРЎвЂ№Р Р†Р В°РЎвЂљРЎРЉ РЎвЂљР ВµР С– <b>[hide] ... [/hide]</b>', 'descr' => '<b>Р вЂќР В°</b> - РЎвЂљР ВµР С”РЎРѓРЎвЂљ Р С•РЎвЂљР С�Р ВµРЎвЂЎР ВµР Р…Р Р…РЎвЂ№Р в„– РЎвЂљР ВµР С–Р С•Р С� <b>hide</b> Р Р…Р Вµ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµРЎвЂљРЎРѓРЎРЏ<br><b>Р СњР ВµРЎвЂљ</b> - РЎвЂљР ВµР С”РЎРѓРЎвЂљ Р С•РЎвЂљР С�Р ВµРЎвЂЎР ВµР Р…Р Р…РЎвЂ№Р в„– РЎвЂљР ВµР С–Р С•Р С� <b>hide</b> Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµРЎвЂљРЎРѓРЎРЏ', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), value => pluginGetVariable('rss_export', 'use_hide')));
array_push($cfgX, array('type' => 'select', 'name' => 'content_show', 'title' => 'Р вЂ™Р С‘Р Т‘ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘', 'descr' => 'Р вЂ™Р В°Р С� Р Р…Р ВµР С•Р В±РЎвЂ¦Р С•Р Т‘Р С‘Р С�Р С• РЎС“Р С”Р В°Р В·Р В°РЎвЂљРЎРЉ Р С”Р В°Р С”Р В°РЎРЏ Р С‘Р С�Р ВµР Р…Р Р…Р С• Р С‘Р Р…РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂ Р С‘РЎРЏ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘, РЎРЊР С”РЎРѓР С—Р С•РЎР‚РЎвЂљР С‘РЎР‚РЎС“Р ВµР С�Р С•Р в„– РЎвЂЎР ВµРЎР‚Р ВµР В· RSS', 'values' => array('0' => 'Р С”Р С•РЎР‚Р С•РЎвЂљР С”Р В°РЎРЏ+Р Т‘Р В»Р С‘Р Р…Р Р…Р В°РЎРЏ', '1' => 'РЎвЂљР С•Р В»РЎРЉР С”Р С• Р С”Р С•РЎР‚Р С•РЎвЂљР С”Р В°РЎРЏ', '2' => 'РЎвЂљР С•Р В»РЎРЉР С”Р С• Р Т‘Р В»Р С‘Р Р…Р Р…Р В°РЎРЏ'), value => pluginGetVariable('rss_export', 'content_show')));
array_push($cfgX, array('type' => 'input', 'name' => 'truncate', 'title' => 'Р С›Р В±РЎР‚Р ВµР В·Р В°РЎвЂљРЎРЉ Р Р†РЎвЂ№Р Р†Р С•Р Т‘Р С‘Р С�РЎС“РЎР‹ Р С‘Р Р…РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂ Р С‘РЎР‹', 'descr' => 'Р С™Р С•Р В»-Р Р†Р С• РЎРѓР С‘Р С�Р Р†Р С•Р В»Р С•Р Р† Р Т‘Р С• Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№РЎвЂ¦ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С•Р В±РЎР‚Р ВµР В·Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†РЎвЂ№Р Р†Р С•Р Т‘Р С‘Р С�Р В°РЎРЏ Р Р† Р В»Р ВµР Р…РЎвЂљР Вµ Р С‘Р Р…РЎвЂћР С•РЎР‚Р С�Р В°РЎвЂ Р С‘РЎРЏ.<br/>Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>0</b> - Р Р…Р Вµ Р С•Р В±РЎР‚Р ВµР В·Р В°РЎвЂљРЎРЉ', value => intval(pluginGetVariable('rss_export', 'truncate'))));
array_push($cfgX, array('type' => 'input', 'name' => 'delay', 'title' => 'Р С›РЎвЂљРЎРѓРЎР‚Р С•РЎвЂЎР С”Р В° Р Р†РЎвЂ№Р Р†Р С•Р Т‘Р В° Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Р† Р В»Р ВµР Р…РЎвЂљРЎС“', 'descr' => 'Р вЂ™РЎвЂ№ Р С�Р С•Р В¶Р ВµРЎвЂљР Вµ Р В·Р В°Р Т‘Р В°РЎвЂљРЎРЉ Р Р†РЎР‚Р ВµР С�РЎРЏ (<b>Р Р† Р С�Р С‘Р Р…РЎС“РЎвЂљР В°РЎвЂ¦</b>) Р Р…Р В° Р С”Р С•РЎвЂљР С•РЎР‚Р С•Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С•РЎвЂљР С”Р В»Р В°Р Т‘РЎвЂ№Р Р†Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†РЎвЂ№Р Р†Р С•Р Т‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Р† RSS Р В»Р ВµР Р…РЎвЂљРЎС“', value => pluginGetVariable('rss_export', 'delay')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р С›Р В±РЎвЂ°Р С‘Р Вµ Р Р…Р В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'xfEnclosureEnabled', 'title' => "Р вЂњР ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘РЎРЏ Р С—Р С•Р В»РЎРЏ 'Enclosure' Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“РЎРЏ Р Т‘Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° xfields", 'descr' => "<b>Р вЂќР В°</b> - Р Р†Р С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С–Р ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘РЎР‹<br /><b>Р СњР ВµРЎвЂљ</b> - Р С•РЎвЂљР С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С–Р ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘РЎР‹</small>", 'type' => 'select', 'values' => array('1' => 'Р вЂќР В°', '0' => 'Р СњР ВµРЎвЂљ'), 'value' => intval(pluginGetVariable($plugin, 'xfEnclosureEnabled'))));
array_push($cfgX, array('name' => 'xfEnclosure', 'title' => "ID Р С—Р С•Р В»РЎРЏ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° <b>xfields</b>, Р С”Р С•РЎвЂљР С•РЎР‚Р С•Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Т‘Р В»РЎРЏ Р С–Р ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘Р С‘ Р С—Р С•Р В»РЎРЏ <b>Enclosure</b>", 'type' => 'select', 'values' => $xfEnclosureValues, 'value' => pluginGetVariable($plugin, 'xfEnclosure')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р вЂњР ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘РЎРЏ Р С—Р С•Р В»РЎРЏ <b>enclosure</b></b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'cache', 'title' => "Р пїЅРЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Т‘Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦<br /><small><b>Р вЂќР В°</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ<br /><b>Р СњР ВµРЎвЂљ</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ</small>", 'type' => 'select', 'values' => array('1' => 'Р вЂќР В°', '0' => 'Р СњР ВµРЎвЂљ'), 'value' => intval(pluginGetVariable($plugin, 'cache'))));
array_push($cfgX, array('name' => 'cacheExpire', 'title' => "Р СџР ВµРЎР‚Р С‘Р С•Р Т‘ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р С”Р ВµРЎв‚¬Р В°<br /><small>(РЎвЂЎР ВµРЎР‚Р ВµР В· РЎРѓР С”Р С•Р В»РЎРЉР С”Р С• РЎРѓР ВµР С”РЎС“Р Р…Р Т‘ Р С—РЎР‚Р С•Р С‘РЎРѓРЎвЂ¦Р С•Р Т‘Р С‘РЎвЂљ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р С”Р ВµРЎв‚¬Р В°. Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>60</b>)</small>", 'type' => 'input', 'value' => intval(pluginGetVariable($plugin, 'cacheExpire')) ? pluginGetVariable($plugin, 'cacheExpire') : '60'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
// RUN
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}
?>