Р Р€Р Р†Р В°Р В¶Р В°Р ВµР С�РЎвЂ№Р в„– Р В°Р Т‘Р С�Р С‘Р Р…Р С‘РЎРѓРЎвЂљРЎР‚Р В°РЎвЂљР С•РЎР‚!
Р вЂ™Р В°Р С� РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂЎРЎвЂљР С• Р В±РЎвЂ№Р В»Р С• Р С•РЎвЂљР С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С• РЎРѓР С•Р С•Р В±РЎвЂ°Р ВµР Р…Р С‘Р Вµ РЎвЂЎР ВµРЎР‚Р ВµР В· РЎвЂћР С•РЎР‚Р С�РЎС“ Р С•Р В±РЎР‚Р В°РЎвЂљР Р…Р С•Р в„– РЎРѓР Р†РЎРЏР В·Р С‘.

Р СџР В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚РЎвЂ№ РЎвЂћР С•РЎР‚Р С�РЎвЂ№:
* ID: {{ form.id }}
* Р СњР В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ: {{ form.title }}
* Р С›Р С—Р С‘РЎРѓР В°Р Р…Р С‘Р Вµ: {{ form.description }}
{% if (flags.link_news) %}
	Р вЂ”Р В°Р С—РЎР‚Р С•РЎРѓ Р С—Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘:
	* ID: {{ news.id }}
	* Р РЋРЎРѓРЎвЂ№Р В»Р С”Р В°: {{ news.url }}
	* Р вЂ”Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С”:{{ news.title }}

{% endif %}

Р СџР С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљР ВµР В»РЎРЉ Р В·Р В°Р С—Р С•Р В»Р Р…Р С‘Р В» РЎРѓР В»Р ВµР Т‘РЎС“РЎР‹РЎвЂ°Р С‘Р Вµ Р С—Р С•Р В»РЎРЏ:
{% for entry in entries %}
	* ({{ entry.id }})[{{ entry.title }}]: {{ entry.value }}
{% endfor %}

---
Р РЋ РЎС“Р Р†Р В°Р В¶Р ВµР Р…Р С‘Р ВµР С�,
Р С—Р С•РЎвЂЎРЎвЂљР С•Р Р†РЎвЂ№Р в„– РЎР‚Р С•Р В±Р С•РЎвЂљ Р вЂ™Р В°РЎв‚¬Р ВµР С–Р С• РЎРѓР В°Р в„–РЎвЂљР В° (РЎР‚Р В°Р В±Р С•РЎвЂљР В°Р ВµРЎвЂљ Р Р…Р В° Р В±Р В°Р В·Р Вµ Next Generation CMS - http://ngcms.ru/)
