<?php
// Protect against hack attempts
if (!defined('NGCMS')) die ('HAL');
//
// Configuration file for plugin
//
// Preload config file
plugins_load_config();
// Load XFields config
if (!function_exists('xf_configLoad')) {
	print "XFields plugin is not loaded now!";
} else {
	$XFc = xf_configLoad();
	$xfCatList = array('' => ' // Р Р…Р Вµ Р Р†РЎвЂ№Р В±РЎР‚Р В°Р Р…Р С• //');
	foreach ($XFc['news'] as $k => $v) {
		if ($v['type'] == 'images')
			continue;
		$xfCatList[$k] = $k . ' - ' . $v['title'];
	}
	$xfNTableList = array('' => ' // Р Р…Р Вµ Р Р†РЎвЂ№Р В±РЎР‚Р В°Р Р…Р С• //');
	foreach ($XFc['tdata'] as $k => $v) {
		if ($v['type'] == 'images')
			continue;
		$xfNTableList[$k] = $k . ' - ' . $v['title'];
	}
}
// Check if `feedback` plugin is installed
$feedbackFormList = array();
if (getPluginStatusInstalled('feedback')) {
	foreach ($mysql->select("select * from " . prefix . "_feedback order by id", 1) as $frow) {
		$feedbackFormList [$frow['id']] = $frow['id'] . ' - ' . $frow['title'];
	}
	if (!count($feedbackFormList)) {
		$feedbackFormList [0] = '// РЎвЂћР С•РЎР‚Р С�РЎвЂ№ Р Р…Р Вµ Р Р…Р В°Р в„–Р Т‘Р ВµР Р…РЎвЂ№ //';
	}
} else {
	$feedbackFormList [0] = '// Р С—Р В»Р В°Р С–Р С‘Р Р… Р Р…Р Вµ РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р В»Р ВµР Р… //';
}
// Fill configuration parameters
$cfg = array();
array_push($cfg, array('descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… РЎР‚Р ВµР В°Р В»Р С‘Р В·РЎС“Р ВµРЎвЂљ РЎвЂћРЎС“Р Р…Р С”РЎвЂ Р С‘Р С•Р Р…Р В°Р В» "Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ РЎвЂљР С•Р Р†Р В°РЎР‚Р С•Р Р†"<br/><b>Р вЂ™Р Р…Р С‘Р С�Р В°Р Р…Р С‘Р Вµ!</b><br/>Р вЂќР В»РЎРЏ РЎР‚Р В°Р В±Р С•РЎвЂљРЎвЂ№ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° <i>basket</i> Р Р†РЎвЂ№ Р Т‘Р С•Р В»Р В¶Р Р…РЎвЂ№ Р Р†Р С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С‘ Р Р…Р В°РЎРѓРЎвЂљРЎР‚Р С•Р С‘РЎвЂљРЎРЉ Р С—Р В»Р В°Р С–Р С‘Р Р…РЎвЂ№: <b>feedback</b> Р С‘ <b>xfields</b>.'));
/*
$cfgX = array();
array_push($cfgX, array('name' => 'catalog_flag', 'type' => 'select', 'title' => 'Р вЂ™Р С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“ Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°', 'descr' => '<b>Р вЂќР В°</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°<br/><b>Р СњР ВµРЎвЂљ</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р Р…Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°', 'values' => array ( 0 => 'Р СњР ВµРЎвЂљ', 1 => 'Р вЂќР В°'), value => pluginGetVariable('basket','catalog_flag')));
array_push($cfgX, array('name' => 'catalog_activated', 'title' => "Р С’Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р Р† Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р Вµ Р С—Р С•..", 'type' => 'select', 'descr' => '<b>Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�</b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С• Р Т‘Р В»РЎРЏ Р Р†РЎРѓР ВµРЎвЂ¦ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р†<br/><b>Р СџР С•Р В»РЎР‹ <i>xfields</i></b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р С�Р С•Р В¶Р Р…Р С• Р В±РЎС“Р Т‘Р ВµРЎвЂљ РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂљР Вµ Р В·Р В°Р С—Р С‘РЎРѓР С‘, Р Р† Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№РЎвЂ¦ Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ РЎС“Р С”Р В°Р В·Р В°Р Р…Р Р…Р С•Р С–Р С• Р С—Р С•Р В»РЎРЏ <b>> 0</b> (Р В±Р С•Р В»РЎРЉРЎв‚¬Р Вµ Р Р…РЎС“Р В»РЎРЏ)', 'values' => array(0 => 'Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�', 1 => 'Р СџР С•Р В»РЎР‹ xfields'), 'value' => pluginGetVariable('basket','catalog_activated')));
array_push($cfgX, array('name' => 'catalog_xfield', 'title' => "Р СџР С•Р В»Р Вµ xfields", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ Р Т‘Р В»РЎРЏ Р С—Р В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚Р В° "Р В°Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р С—Р С•.."', 'values' => $xfCatList, 'value' => pluginGetVariable('basket','catalog_xfield')));
array_push($cfgX, array('name' => 'catalog_price', 'title' => "Р СџР С•Р В»Р Вµ РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„–", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ xfields РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„– РЎвЂљР С•Р Р†Р В°РЎР‚Р В°', 'values' => $xfCatList, 'value' => pluginGetVariable('basket','catalog_price')));
array_push($cfgX, array('name' => 'catalog_itemname', 'type' => 'input', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В°РЎвЂљ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ РЎвЂљР С•Р Р†Р В°РЎР‚Р В°:', 'descr' => 'Р вЂќР С•РЎРѓРЎвЂљРЎС“Р С—Р Р…РЎвЂ№Р Вµ Р С—Р ВµРЎР‚Р ВµР С�Р ВµР Р…Р Р…РЎвЂ№Р Вµ:<br/><b>{title}</b> - Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘Р Вµ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР В° Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°<br/><b>{x:NAME}</b> (Р С–Р Т‘Р Вµ <b>NAME</b> - Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В»РЎРЏ XFIELDS) - Р Р†РЎвЂ№Р Р†Р ВµРЎРѓРЎвЂљР С‘ Р Т‘Р С•Р С—. Р С—Р С•Р В»Р Вµ', 'html_flags' => 'style="width: 300px;"', 'value' => pluginGetVariable('basket','catalog_itemname')?pluginGetVariable('basket','catalog_itemname'):'{title}'));
array_push($cfg,  array('mode' => 'group', 'title' => '<b>Р В Р В°Р В±Р С•РЎвЂљР В° РЎРѓ Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р С•Р С�</b>', 'entries' => $cfgX));
*/
$cfgX = array();
array_push($cfgX, array('name' => 'ntable_flag', 'type' => 'select', 'title' => 'Р вЂ™Р С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“ Р Т‘Р В»РЎРЏ РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ  Р Т‘Р С•Р С—. Р С—Р С•Р В»Р ВµР в„– Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–', 'descr' => '<b>Р вЂќР В°</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎвЂ№<br/><b>Р СњР ВµРЎвЂљ</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р Р…Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎвЂ№', 'values' => array(0 => 'Р СњР ВµРЎвЂљ', 1 => 'Р вЂќР В°'), value => pluginGetVariable('basket', 'ntable_flag')));
array_push($cfgX, array('name' => 'ntable_activated', 'title' => "Р С’Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р Р† РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ Р Вµ Р С—Р С•..", 'type' => 'select', 'descr' => '<b>Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�</b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С• Р Т‘Р В»РЎРЏ Р Р†РЎРѓР ВµРЎвЂ¦ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р†<br/><b>Р СџР С•Р В»РЎР‹ <i>xfields</i></b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р С�Р С•Р В¶Р Р…Р С• Р В±РЎС“Р Т‘Р ВµРЎвЂљ РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂљР Вµ Р В·Р В°Р С—Р С‘РЎРѓР С‘, Р Р† Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№РЎвЂ¦ Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ РЎС“Р С”Р В°Р В·Р В°Р Р…Р Р…Р С•Р С–Р С• Р С—Р С•Р В»РЎРЏ <b>> 0</b> (Р В±Р С•Р В»РЎРЉРЎв‚¬Р Вµ Р Р…РЎС“Р В»РЎРЏ)', 'values' => array(0 => 'Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�', 1 => 'Р СџР С•Р В»РЎР‹ xfields'), 'value' => pluginGetVariable('basket', 'ntable_activated')));
array_push($cfgX, array('name' => 'ntable_xfield', 'title' => "Р СџР С•Р В»Р Вµ xfields", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ Р Т‘Р В»РЎРЏ Р С—Р В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚Р В° "Р В°Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р С—Р С•.."', 'values' => $xfNTableList, 'value' => pluginGetVariable('basket', 'ntable_xfield')));
array_push($cfgX, array('name' => 'ntable_price', 'title' => "Р СџР С•Р В»Р Вµ РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„–", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ xfields РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„– РЎвЂљР С•Р Р†Р В°РЎР‚Р В°', 'values' => $xfNTableList, 'value' => pluginGetVariable('basket', 'ntable_price')));
array_push($cfgX, array('name' => 'ntable_itemname', 'type' => 'input', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В°РЎвЂљ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ РЎвЂљР С•Р Р†Р В°РЎР‚Р В°:', 'descr' => 'Р вЂќР С•РЎРѓРЎвЂљРЎС“Р С—Р Р…РЎвЂ№Р Вµ Р С—Р ВµРЎР‚Р ВµР С�Р ВµР Р…Р Р…РЎвЂ№Р Вµ:<br/><b>{title}</b> - Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘Р Вµ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР В° Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°<br/><b>{xt:NAME}</b> (Р С–Р Т‘Р Вµ <b>NAME</b> - Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В»РЎРЏ XFIELDS) - Р Р†РЎвЂ№Р Р†Р ВµРЎРѓРЎвЂљР С‘ Р Т‘Р С•Р С—. Р С—Р С•Р В»Р Вµ <u>РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎвЂ№</u><br/><b>{x:NAME}</b> (Р С–Р Т‘Р Вµ <b>NAME</b> - Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В»РЎРЏ XFIELDS) - Р Р†РЎвЂ№Р Р†Р ВµРЎРѓРЎвЂљР С‘ Р Т‘Р С•Р С—. Р С—Р С•Р В»Р Вµ Р С‘Р В· Р С•РЎР‚Р С‘Р С–Р С‘Р Р…Р В°Р В»РЎРЉР Р…Р С•Р в„– <u>Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘</u>', 'html_flags' => 'style="width: 300px;"', 'value' => pluginGetVariable('basket', 'ntable_itemname') ? pluginGetVariable('basket', 'ntable_itemname') : '{title}'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р В Р В°Р В±Р С•РЎвЂљР В° РЎРѓ РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ Р В°Р С�Р С‘ Р Т‘Р С•Р С—. Р С—Р С•Р В»Р ВµР в„– Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'news_flag', 'type' => 'select', 'title' => 'Р вЂ™Р С”Р В»РЎР‹РЎвЂЎР С‘РЎвЂљРЎРЉ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“ Р Т‘Р В»РЎРЏ РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ  Р Т‘Р С•Р С—. Р С—Р С•Р В»Р ВµР в„– Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–', 'descr' => '<b>Р вЂќР В°</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎвЂ№<br/><b>Р СњР ВµРЎвЂљ</b> - Р С”Р С•РЎР‚Р В·Р С‘Р Р…Р В° Р Р…Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В°Р С”РЎвЂљР С‘Р Р†Р Р…Р В° Р Т‘Р В»РЎРЏ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР С•Р Р† РЎвЂљР В°Р В±Р В»Р С‘РЎвЂ РЎвЂ№', 'values' => array(0 => 'Р СњР ВµРЎвЂљ', 1 => 'Р вЂќР В°'), value => pluginGetVariable('basket', 'news_flag')));
array_push($cfgX, array('name' => 'news_activated', 'title' => "Р С’Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р Р† Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљРЎРЏРЎвЂ¦ Р С—Р С•..", 'type' => 'select', 'descr' => '<b>Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�</b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С• Р Т‘Р В»РЎРЏ Р Р†РЎРѓР ВµРЎвЂ¦ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–<br/><b>Р СџР С•Р В»РЎР‹ <i>xfields</i></b> - "Р С—Р С•Р В»Р С•Р В¶Р С‘РЎвЂљРЎРЉ Р Р† Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎС“" Р С�Р С•Р В¶Р Р…Р С• Р В±РЎС“Р Т‘Р ВµРЎвЂљ РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂљР Вµ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘, Р Р† Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№РЎвЂ¦ Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ РЎС“Р С”Р В°Р В·Р В°Р Р…Р Р…Р С•Р С–Р С• Р С—Р С•Р В»РЎРЏ <b>> 0</b> (Р В±Р С•Р В»РЎРЉРЎв‚¬Р Вµ Р Р…РЎС“Р В»РЎРЏ)', 'values' => array(0 => 'Р вЂ™РЎРѓР ВµР С� Р В·Р В°Р С—Р С‘РЎРѓРЎРЏР С�', 1 => 'Р СџР С•Р В»РЎР‹ xfields'), 'value' => pluginGetVariable('basket', 'news_activated')));
array_push($cfgX, array('name' => 'news_xfield', 'title' => "Р СџР С•Р В»Р Вµ xfields", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ Р Т‘Р В»РЎРЏ Р С—Р В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚Р В° "Р В°Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘РЎРЏ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ Р С—Р С•.."', 'values' => $xfCatList, 'value' => pluginGetVariable('basket', 'news_xfield')));
array_push($cfgX, array('name' => 'news_price', 'title' => "Р СџР С•Р В»Р Вµ РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„–", 'type' => 'select', 'descr' => 'Р СџР С•Р В»Р Вµ xfields РЎРѓ РЎвЂ Р ВµР Р…Р С•Р в„– РЎвЂљР С•Р Р†Р В°РЎР‚Р В°', 'values' => $xfCatList, 'value' => pluginGetVariable('basket', 'news_price')));
array_push($cfgX, array('name' => 'news_itemname', 'type' => 'input', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В°РЎвЂљ Р В·Р В°Р С–Р С•Р В»Р С•Р Р†Р С”Р В° Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ РЎвЂљР С•Р Р†Р В°РЎР‚Р В°:', 'descr' => 'Р вЂќР С•РЎРѓРЎвЂљРЎС“Р С—Р Р…РЎвЂ№Р Вµ Р С—Р ВµРЎР‚Р ВµР С�Р ВµР Р…Р Р…РЎвЂ№Р Вµ:<br/><b>{title}</b> - Р Р…Р В°Р С‘Р С�Р ВµР Р…Р С•Р Р†Р В°Р Р…Р С‘Р Вµ РЎРЊР В»Р ВµР С�Р ВµР Р…РЎвЂљР В° Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В°<br/><b>{x:NAME}</b> (Р С–Р Т‘Р Вµ <b>NAME</b> - Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—Р С•Р В»РЎРЏ XFIELDS) - Р Р†РЎвЂ№Р Р†Р ВµРЎРѓРЎвЂљР С‘ Р Т‘Р С•Р С—. Р С—Р С•Р В»Р Вµ', 'html_flags' => 'style="width: 300px;"', 'value' => pluginGetVariable('basket', 'ntable_itemname') ? pluginGetVariable('basket', 'news_itemname') : '{title}'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р В Р В°Р В±Р С•РЎвЂљР В° РЎРѓ Р Т‘Р С•Р С—. Р С—Р С•Р В»РЎРЏР С�Р С‘ Р Р†Р Р…РЎС“РЎвЂљРЎР‚Р С‘ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'feedback_form', 'type' => 'select', 'title' => 'Р В¤Р С•РЎР‚Р С�Р В° Р С•Р В±РЎР‚Р В°РЎвЂљР Р…Р С•Р в„– РЎРѓР Р†РЎРЏР В·Р С‘ Р Т‘Р В»РЎРЏ Р С•РЎвЂћР С•РЎР‚Р С�Р В»Р ВµР Р…Р С‘РЎРЏ Р В·Р В°Р С”Р В°Р В·Р В°', 'descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… <b>basket</b> Р С•РЎвЂљР Р†Р ВµРЎвЂЎР В°Р ВµРЎвЂљ РЎвЂљР С•Р В»РЎРЉР С”Р С• Р В·Р В° Р Р…Р В°Р С—Р С•Р В»Р Р…Р ВµР Р…Р С‘Р Вµ Р С”Р С•РЎР‚Р В·Р С‘Р Р…РЎвЂ№ РЎвЂљР С•Р Р†Р В°РЎР‚Р С•Р Р†.<br/>Р С›РЎвЂљР С—РЎР‚Р В°Р Р†Р С”Р В° Р В·Р В°Р С”Р В°Р В·Р В° Р С—РЎР‚Р С•Р С‘Р В·Р Р†Р С•Р Т‘Р С‘РЎвЂљРЎРѓРЎРЏ РЎвЂЎР ВµРЎР‚Р ВµР В· РЎвЂћР С•РЎР‚Р С�РЎС“ Р С•Р В±РЎР‚Р В°РЎвЂљР Р…Р С•Р в„– РЎРѓР Р†РЎРЏР В·Р С‘ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° <b>feedback</b>.<br/>Р вЂ™РЎвЂ№Р В±Р ВµРЎР‚Р С‘РЎвЂљР Вµ РЎвЂћР С•РЎР‚Р С�РЎС“ Р С•Р В±РЎР‚Р В°РЎвЂљР Р…Р С•Р в„– РЎРѓР Р†РЎРЏР В·Р С‘ РЎвЂЎР ВµРЎР‚Р ВµР В· Р С”Р С•РЎвЂљР С•РЎР‚РЎС“РЎР‹ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С—РЎР‚Р С•Р С‘Р В·Р Р†Р С•Р Т‘Р С‘РЎвЂљРЎРЉРЎРѓРЎРЏ Р С•РЎвЂљР С—РЎР‚Р В°Р Р†Р С”Р В° Р В·Р В°Р С”Р В°Р В·Р В°', 'values' => $feedbackFormList, value => pluginGetVariable('basket', 'feedback_form')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С‘Р Р…РЎвЂљР ВµР С–РЎР‚Р В°РЎвЂ Р С‘Р С‘</b>', 'entries' => $cfgX));
// RUN
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}

