<?php
// Protect against hack attempts
if (!defined('NGCMS')) die ('HAL');
//
// Configuration file for plugin
//
// Preload config file
plugins_load_config();
// Fill configuration parameters
$cfg = array();
$cfgX = array();
array_push($cfg, array('descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµРЎвЂљ "Р С”Р В°Р В»Р ВµР Р…Р Т‘Р В°РЎР‚РЎРЉ" - Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°Р ВµРЎвЂљ Р Т‘Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљРЎРЏРЎвЂ¦ Р С—Р С• Р Р†РЎвЂ№Р В±РЎР‚Р В°Р Р…Р Р…Р С•Р С�РЎС“ Р С�Р ВµРЎРѓРЎРЏРЎвЂ РЎС“ Р С—Р С•Р Т‘РЎРѓР Р†Р ВµРЎвЂЎР С‘Р Р†Р В°РЎРЏ Р Т‘Р Р…Р С‘ Р С”Р С•Р С–Р Т‘Р В° Р В±РЎвЂ№Р В»Р С‘ РЎР‚Р В°Р В·Р С�Р ВµРЎвЂ°Р ВµР Р…РЎвЂ№ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘Р СџРЎР‚Р С‘ Р С”Р В»Р С‘Р С”Р Вµ Р Р…Р В° Р Т‘Р ВµР Р…РЎРЉ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘ Р В·Р В° РЎРЊРЎвЂљР С•РЎвЂљ Р Т‘Р ВµР Р…РЎРЉ'));
$cfgX = array();
array_push($cfgX, array('name' => 'mode', 'title' => "Р вЂ™ Р С”Р В°Р С”Р С•Р С� РЎР‚Р ВµР В¶Р С‘Р С�Р Вµ Р С–Р ВµР Р…Р ВµРЎР‚Р С‘РЎР‚РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ Р Р†РЎвЂ№Р Р†Р С•Р Т‘ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°<br /><small><b>Р С’Р Р†РЎвЂљР С•Р С�Р В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘</b> - Р С—РЎР‚Р С‘ Р Р†Р С”Р В»РЎР‹РЎвЂЎР ВµР Р…Р С‘Р С‘ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° Р В°Р Р†РЎвЂљР С•Р С�Р В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘ Р С–Р ВµР Р…Р ВµРЎР‚Р С‘РЎР‚РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ Р В±Р В»Р С•Р С” {plugin_comments}<br /><b>TWIG</b> - Р Р†РЎвЂ№Р Р†Р С•Р Т‘ Р С—Р В»Р В°Р С–Р С‘Р Р…Р В° Р С–Р ВµР Р…Р ВµРЎР‚Р С‘РЎР‚РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂЎР ВµРЎР‚Р ВµР В· TWIG РЎвЂћРЎС“Р Р…Р С”РЎвЂ Р С‘РЎР‹ <b>callPlugin()</b></small>", 'type' => 'select', 'values' => array('0' => 'Р С’Р Р†РЎвЂљР С•Р С�Р В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘', '1' => 'TWIG'), 'value' => intval(pluginGetVariable($plugin, 'mode'))));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р В Р ВµР В¶Р С‘Р С� Р В·Р В°Р С—РЎС“РЎРѓР С”Р В°</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'localsource', 'title' => "Р вЂ™РЎвЂ№Р В±Р ВµРЎР‚Р С‘РЎвЂљР Вµ Р С”Р В°РЎвЂљР В°Р В»Р С•Р С– Р С‘Р В· Р С”Р С•РЎвЂљР С•РЎР‚Р С•Р С–Р С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small><b>Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°</b> - Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С—РЎвЂ№РЎвЂљР В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†Р В·РЎРЏРЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р С‘Р В· Р С•Р В±РЎвЂ°Р ВµР С–Р С• РЎв‚¬Р В°Р В±Р В»Р С•Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљР В°; Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р Р…Р ВµР Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С•РЎРѓРЎвЂљР С‘ - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р Р†Р В·РЎРЏРЎвЂљРЎвЂ№ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°<br /><b>Р СџР В»Р В°Р С–Р С‘Р Р…</b> - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°</small>", 'type' => 'select', 'values' => array('0' => 'Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°', '1' => 'Р СџР В»Р В°Р С–Р С‘Р Р…'), 'value' => intval(pluginGetVariable($plugin, 'localsource'))));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'cache', 'title' => "Р пїЅРЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Т‘Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦<br /><small><b>Р вЂќР В°</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ<br /><b>Р СњР ВµРЎвЂљ</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ</small>", 'type' => 'select', 'values' => array('1' => 'Р вЂќР В°', '0' => 'Р СњР ВµРЎвЂљ'), 'value' => intval(pluginGetVariable($plugin, 'cache'))));
array_push($cfgX, array('name' => 'cacheExpire', 'title' => "Р СџР ВµРЎР‚Р С‘Р С•Р Т‘ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р С”Р ВµРЎв‚¬Р В°<br /><small>(РЎвЂЎР ВµРЎР‚Р ВµР В· РЎРѓР С”Р С•Р В»РЎРЉР С”Р С• РЎРѓР ВµР С”РЎС“Р Р…Р Т‘ Р С—РЎР‚Р С•Р С‘РЎРѓРЎвЂ¦Р С•Р Т‘Р С‘РЎвЂљ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р С”Р ВµРЎв‚¬Р В°. Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>60</b>)</small>", 'type' => 'input', 'value' => intval(pluginGetVariable($plugin, 'cacheExpire')) ? pluginGetVariable($plugin, 'cacheExpire') : '60'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
// RUN 
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}
?>