Р Р€Р Р†Р В°Р В¶Р В°Р ВµР С�РЎвЂ№Р в„–, {login}!<br/>
<br/>
==============================================<br/>
Р вЂ™Р СњР пїЅР СљР С’Р СњР пїЅР вЂў<br/>
==============================================<br/>
<br/>
Р СџР С•Р В·РЎР‚Р В°Р Р†Р В»РЎРЏР ВµР С� Р вЂ™Р В°РЎРѓ РЎРѓ РЎР‚Р ВµР С–Р С‘РЎРѓРЎвЂљРЎР‚Р В°РЎвЂ Р С‘Р ВµР в„– Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљР Вµ {home}<br/><br/>
Р вЂ™Р В°РЎв‚¬Р С‘ Р Т‘Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р Т‘Р В»РЎРЏ Р Р†РЎвЂ¦Р С•Р Т‘Р В° Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљ:<br/>
Р вЂєР С•Р С–Р С‘Р Р…: {login}<br/>
Р СџР В°РЎР‚Р С•Р В»РЎРЉ: {password}<br/><br/>
[activation]
Р вЂќР В»РЎРЏ Р В°Р С”РЎвЂљР С‘Р Р†Р В°РЎвЂ Р С‘Р С‘ Р вЂ™Р В°РЎв‚¬Р ВµР в„– РЎС“РЎвЂЎРЎвЂ�РЎвЂљР Р…Р С•Р в„– Р В·Р В°Р С—Р С‘РЎРѓР С‘ Р вЂ™Р В°Р С� Р Р…Р ВµР С•Р В±РЎвЂ¦Р С•Р Т‘Р С‘Р С�Р С• Р С—Р ВµРЎР‚Р ВµР в„–РЎвЂљР С‘ Р С—Р С• РЎРЊРЎвЂљР С•Р в„– РЎРѓРЎРѓРЎвЂ№Р В»Р С”Р Вµ: {activate_url}<br/>[/activation]
<br/>
<br/>
---<br/>
Р РЋ РЎС“Р Р†Р В°Р В¶Р ВµР Р…Р С‘Р ВµР С�,<br/>
Р В°Р Т‘Р С�Р С‘Р Р…Р С‘РЎРѓРЎвЂљРЎР‚Р В°РЎвЂ Р С‘РЎРЏ РЎРѓР В°Р в„–РЎвЂљР В° {home}<br/>
<br/>
