Р Р€Р Р†Р В°Р В¶Р В°Р ВµР С�РЎвЂ№Р в„–, {login}!<br/>
<br/>
==============================================<br/>
Р вЂ™Р СњР пїЅР СљР С’Р СњР пїЅР вЂў<br/>
==============================================<br/>
<br/>
Р вЂ™РЎвЂ№ Р С‘Р В»Р С‘ Р С”РЎвЂљР С•-РЎвЂљР С•, РЎС“Р С”Р В°Р В·Р В°Р Р†РЎв‚¬Р С‘Р в„– Р Р†Р В°РЎв‚¬Р С‘ РЎР‚Р ВµР С–Р С‘РЎРѓРЎвЂљРЎР‚Р В°РЎвЂ Р С‘Р С•Р Р…Р Р…РЎвЂ№Р Вµ Р Т‘Р В°Р Р…Р Р…РЎвЂ№Р Вµ, РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂЎРЎвЂљР С• Р В·Р В°Р С—РЎР‚Р С•РЎРѓР С‘Р В»Р С‘ Р Р†Р С•РЎРѓРЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ
Р В·Р В°Р В±РЎвЂ№РЎвЂљР С•Р С–Р С• Р С—Р В°РЎР‚Р С•Р В»РЎРЏ Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљР Вµ {home}<br/>
<br/>
Р вЂўРЎРѓР В»Р С‘ Р В·Р В°Р С—РЎР‚Р С•РЎРѓ Р С•РЎвЂљР С—РЎР‚Р В°Р Р†Р В»Р ВµР Р… Р Р…Р Вµ Р вЂ™Р В°Р С�Р С‘, РЎвЂљР С• Р С—РЎР‚Р С•РЎРѓРЎвЂљР С• Р С—РЎР‚Р С•Р С‘Р С–Р Р…Р С•РЎР‚Р С‘РЎР‚РЎС“Р в„–РЎвЂљР Вµ РЎРЊРЎвЂљР С• РЎРѓР С•Р С•Р В±РЎвЂ°Р ВµР Р…Р С‘Р Вµ!<br/>
<br/>
==============================================<br/>
<br/>
Р вЂ™Р В°РЎв‚¬ Р Р…Р С•Р Р†РЎвЂ№Р в„– Р С—Р В°РЎР‚Р С•Р В»РЎРЉ: {newpw}<br/>
Р вЂќР В»РЎРЏ РЎвЂљР С•Р С–Р С•, РЎвЂЎРЎвЂљР С•Р В±РЎвЂ№ Р С—Р В°РЎР‚Р С•Р В»РЎРЉ Р Р†РЎРѓРЎвЂљРЎС“Р С—Р С‘Р В» Р Р† РЎРѓР С‘Р В»РЎС“, Р Р†Р В°Р С� Р Р…Р ВµР С•Р В±РЎвЂ¦Р С•Р Т‘Р С‘Р С�Р С•  Р С—Р ВµРЎР‚Р ВµР в„–РЎвЂљР С‘ Р С—Р С• РЎРЊРЎвЂљР С•Р в„– РЎРѓРЎРѓРЎвЂ№Р В»Р С”Р Вµ: {pwurl}<br/>
<br/>
<br/>
---<br/>
Р РЋ РЎС“Р Р†Р В°Р В¶Р ВµР Р…Р С‘Р ВµР С�,<br/>
Р В°Р Т‘Р С�Р С‘Р Р…Р С‘РЎРѓРЎвЂљРЎР‚Р В°РЎвЂ Р С‘РЎРЏ РЎРѓР В°Р в„–РЎвЂљР В° {home}<br/>
<br/>
