<?php
// Protect against hack attempts
if (!defined('NGCMS')) die ('Galaxy in danger');
// Preload config file
plugins_load_config();
// Fill configuration parameters
$cfg = array();
array_push($cfg, array('descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… Р С–Р ВµР Р…Р ВµРЎР‚Р С‘РЎР‚РЎС“Р ВµРЎвЂљ РЎРѓРЎРѓРЎвЂ№Р В»Р С”Р С‘ Р Р…Р В° РЎРѓР В»Р ВµР Т‘РЎС“РЎР‹РЎвЂ°РЎС“РЎР‹ Р С‘ Р С—РЎР‚Р ВµР Т‘РЎвЂ№Р Т‘РЎС“РЎвЂ°РЎС“РЎР‹ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘.'));
array_push($cfg, array('name' => 'full_mode', 'title' => "Р вЂ™РЎвЂ№Р Р†Р С•Р Т‘Р С‘РЎвЂљРЎРЉ Р Р† Р С—Р С•Р В»Р Р…Р С•Р в„– Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘", 'type' => 'checkbox', value => extra_get_param('neighboring_news', 'full_mode')));
array_push($cfg, array('name' => 'short_mode', 'title' => "Р вЂ™РЎвЂ№Р Р†Р С•Р Т‘Р С‘РЎвЂљРЎРЉ Р Р† Р С”РЎР‚Р В°РЎвЂљР С”Р С•Р в„– Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘<br /><small>Р СњР Вµ РЎР‚Р ВµР С”Р С•Р С�Р ВµР Р…Р Т‘РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ, РЎвЂљ.Р С”. Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В·Р В°Р С—РЎР‚Р С•РЎРѓР С•Р Р† Р С” Р вЂ�Р вЂќ РЎС“Р Р†Р ВµР В»Р С‘РЎвЂЎР С‘РЎвЂљРЎРѓРЎРЏ Р Р…Р В° (2*Р С”Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Р…Р В° Р С–Р В»Р В°Р Р†Р Р…Р С•Р в„– РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ Р Вµ)</small>", 'type' => 'checkbox', value => extra_get_param('neighboring_news', 'short_mode')));
array_push($cfg, array('name' => 'compare', 'title' => 'Р СџР В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚ Р Р†РЎвЂ№Р В±Р С•РЎР‚Р С”Р С‘ Р С‘Р В· Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–', 'type' => 'select', 'values' => array('1' => '1 - Р Р€РЎвЂЎР С‘РЎвЂљРЎвЂ№Р Р†Р В°Р ВµР С� РЎвЂљР С•Р В»РЎРЉР С”Р С• Р С–Р В»Р В°Р Р†Р Р…РЎС“РЎР‹', '2' => '2 - Р СџР С•Р В»Р Р…Р С•Р Вµ РЎРѓР С•Р С•РЎвЂљР Р†Р ВµРЎвЂљРЎРѓРЎвЂљР Р†Р С‘Р Вµ'), value => intval(extra_get_param('neighboring_news', 'compare'))));
array_push($cfg, array('name' => 'localsource', 'title' => "Р вЂ™РЎвЂ№Р В±Р ВµРЎР‚Р С‘РЎвЂљР Вµ Р С”Р В°РЎвЂљР В°Р В»Р С•Р С– Р С‘Р В· Р С”Р С•РЎвЂљР С•РЎР‚Р С•Р С–Р С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small><b>Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°</b> - Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С—РЎвЂ№РЎвЂљР В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†Р В·РЎРЏРЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р С‘Р В· Р С•Р В±РЎвЂ°Р ВµР С–Р С• РЎв‚¬Р В°Р В±Р В»Р С•Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљР В°; Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р Р…Р ВµР Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С•РЎРѓРЎвЂљР С‘ - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р Р†Р В·РЎРЏРЎвЂљРЎвЂ№ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°<br /><b>Р СџР В»Р В°Р С–Р С‘Р Р…</b> - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°</small>", 'type' => 'select', 'values' => array('0' => 'Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°', '1' => 'Р СџР В»Р В°Р С–Р С‘Р Р…'), 'value' => intval(extra_get_param('neighboring_news', 'localsource'))));
// RUN
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes('neighboring_news', $cfg);
	print_commit_complete('neighboring_news');
} else {
	generate_config_page('neighboring_news', $cfg);
}
?>
