<?php
// Protect against hack attempts
if (!defined('NGCMS')) die ('HAL');
//
// Configuration file for plugin
//
// Preload config file
plugins_load_config();
// Fill configuration parameters
$cfg = array();
$cfgX = array();
array_push($cfg, array('descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… Р С–Р ВµР Р…Р ВµРЎР‚Р В°РЎвЂ Р С‘Р С‘ XML Р С”Р В°РЎР‚РЎвЂљРЎвЂ№ РЎРѓР В°Р в„–РЎвЂљР В° Р Т‘Р В»РЎРЏ Р С—Р С•Р С‘РЎРѓР С”Р С•Р Р†Р С•Р в„– РЎРѓР С‘РЎРѓРЎвЂљР ВµР С�РЎвЂ№ Google'));
array_push($cfgX, array('name' => 'main', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ Р С–Р С•Р В»Р С•Р Р†Р Р…РЎС“РЎР‹ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎС“ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'descr' => "<b>Р вЂќР В°</b> - РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ Р В° Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉРЎРѓРЎРЏ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°<br /><b>Р СњР ВµРЎвЂљ</b> - РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ Р В° Р Р…Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉРЎРѓРЎРЏ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'main'))));
array_push($cfgX, array('name' => 'main_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ Р С–Р С•Р В»Р С•Р Р†Р Р…Р С•Р в„– РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№", 'descr' => 'Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С•РЎвЂљ <b>0.0</b> Р Т‘Р С• <b>1.0</b>', 'type' => 'input', 'value' => (extra_get_param($plugin, 'main_pr') == '') ? '1.0' : extra_get_param($plugin, 'main_pr')));
array_push($cfgX, array('name' => 'mainp', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ Р С—Р С•РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂЎР С”РЎС“ Р С–Р С•Р В»Р С•Р Р†Р Р…Р С•Р в„– РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'descr' => "<b>Р вЂќР В°</b> - РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ Р В° Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉРЎРѓРЎРЏ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°<br /><b>Р СњР ВµРЎвЂљ</b> - РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ Р В° Р Р…Р Вµ Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р Т‘Р С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉРЎРѓРЎРЏ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'mainp'))));
array_push($cfgX, array('name' => 'mainp_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ Р С—Р С•РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂЎР С”Р С‘ Р С–Р С•Р В»Р С•Р Р†Р Р…Р С•Р в„– РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№", 'descr' => 'Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С•РЎвЂљ <b>0.0</b> Р Т‘Р С• <b>1.0</b>', 'type' => 'input', 'value' => (extra_get_param($plugin, 'mainp_pr') == '') ? '0.5' : extra_get_param($plugin, 'mainp_pr')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р Т‘Р В»РЎРЏ Р С–Р С•Р В»Р С•Р Р†Р Р…Р С•Р в„– РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№ РЎРѓР В°Р в„–РЎвЂљР В°</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'cat', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№ Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„– Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'cat'))));
array_push($cfgX, array('name' => 'cat_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ  Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–", 'type' => 'input', 'value' => (extra_get_param($plugin, 'cat_pr') == '') ? '0.5' : extra_get_param($plugin, 'cat_pr')));
array_push($cfgX, array('name' => 'catp', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ Р С—Р С•РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂЎР С”РЎС“ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ  Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„– Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'catp'))));
array_push($cfgX, array('name' => 'catp_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ Р С—Р С•РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂЎР С”Р С‘ Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–", 'type' => 'input', 'value' => (extra_get_param($plugin, 'catp_pr') == '') ? '0.5' : extra_get_param($plugin, 'catp_pr')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р Т‘Р В»РЎРЏ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ  Р С”Р В°РЎвЂљР ВµР С–Р С•РЎР‚Р С‘Р в„–</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'news', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'news'))));
array_push($cfgX, array('name' => 'news_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ  Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–", 'type' => 'input', 'value' => (extra_get_param($plugin, 'news_pr') == '') ? '0.3' : extra_get_param($plugin, 'news_pr')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р Т‘Р В»РЎРЏ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ  Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'static', 'title' => "Р вЂќР С•Р В±Р В°Р Р†Р В»РЎРЏРЎвЂљРЎРЉ РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘Р Вµ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ РЎвЂ№ Р Р† Р С”Р В°РЎР‚РЎвЂљРЎС“ РЎРѓР В°Р в„–РЎвЂљР В°", 'type' => 'select', 'values' => array('0' => 'Р СњР ВµРЎвЂљ', '1' => 'Р вЂќР В°'), 'value' => intval(extra_get_param($plugin, 'static'))));
array_push($cfgX, array('name' => 'static_pr', 'title' => "Р СџРЎР‚Р С‘Р С•РЎР‚Р С‘РЎвЂљР ВµРЎвЂљ РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘РЎвЂ¦ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ ", 'type' => 'input', 'value' => (extra_get_param($plugin, 'static_pr') == '') ? '0.3' : extra_get_param($plugin, 'static_pr')));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р Т‘Р В»РЎРЏ РЎРѓРЎвЂљР В°РЎвЂљР С‘РЎвЂЎР ВµРЎРѓР С”Р С‘РЎвЂ¦ РЎРѓРЎвЂљРЎР‚Р В°Р Р…Р С‘РЎвЂ </b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'cache', 'title' => "Р пїЅРЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С”Р В°РЎР‚РЎвЂљРЎвЂ№ РЎРѓР В°Р в„–РЎвЂљР В°<br /><small><b>Р вЂќР В°</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ<br /><b>Р СњР ВµРЎвЂљ</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ</small>", 'type' => 'select', 'values' => array('1' => 'Р вЂќР В°', '0' => 'Р СњР ВµРЎвЂљ'), 'value' => intval(extra_get_param($plugin, 'cache'))));
array_push($cfgX, array('name' => 'cacheExpire', 'title' => 'Р СџР ВµРЎР‚Р С‘Р С•Р Т‘ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р С”Р ВµРЎв‚¬Р В° (Р Р† РЎРѓР ВµР С”РЎС“Р Р…Р Т‘Р В°РЎвЂ¦)<br /><small>(РЎвЂЎР ВµРЎР‚Р ВµР В· РЎРѓР С”Р С•Р В»РЎРЉР С”Р С• РЎРѓР ВµР С”РЎС“Р Р…Р Т‘ Р С—РЎР‚Р С•Р С‘РЎРѓРЎвЂ¦Р С•Р Т‘Р С‘РЎвЂљ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р С”Р ВµРЎв‚¬Р В°. Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>10800</b>, РЎвЂљ.Р Вµ. 3 РЎвЂЎР В°РЎРѓР В°)', 'type' => 'input', 'value' => intval(extra_get_param($plugin, 'cacheExpire')) ? extra_get_param($plugin, 'cacheExpire') : '10800'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
// RUN 
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}
?>