<?php
//
// Configuration file for plugin
//
// Preload config file
plugins_load_config();
$count = extra_get_param($plugin, 'count');
if ((intval($count) < 1) || (intval($count) > 20))
	$count = 1;
// Fill configuration parameters
$cfg = array();
array_push($cfg, array('descr' => 'Р СџР В»Р В°Р С–Р С‘Р Р… RSS Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„–.'));
array_push($cfg, array('name' => 'count', 'title' => 'Р С™Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р В±Р В»Р С•Р С”Р С•Р Р† РЎРѓ RSS Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљРЎРЏР С�Р С‘', 'type' => 'input', 'value' => $count));
for ($i = 1; $i <= $count; $i++) {
	$cfgX = array();
	array_push($cfgX, array('name' => 'rss' . $i . '_name', 'title' => 'Р вЂ”Р В°Р С–Р С•Р В»Р С•Р Р†Р С•Р С” Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small>Р СњР В°Р С—РЎР‚Р С‘Р С�Р ВµРЎР‚: <b>Next Generation CMS</b></small>', 'type' => 'input', 'value' => extra_get_param($plugin, 'rss' . $i . '_name')));
	array_push($cfgX, array('name' => 'rss' . $i . '_url', 'title' => 'Р С’Р Т‘РЎР‚Р ВµРЎРѓ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small>Р СњР В°Р С—РЎР‚Р С‘Р С�Р ВµРЎР‚: <b>http://ngcms.ru</b></small>', 'type' => 'input', 'value' => extra_get_param($plugin, 'rss' . $i . '_url')));
	array_push($cfgX, array('name' => 'rss' . $i . '_number', 'title' => 'Р С™Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР ВµР в„– Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small>Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>10</b></small>', 'type' => 'input', 'value' => intval(extra_get_param($plugin, 'rss' . $i . '_number')) ? extra_get_param($plugin, 'rss' . $i . '_number') : '10'));
	array_push($cfgX, array('name' => 'rss' . $i . '_maxlength', 'title' => 'Р С›Р С–РЎР‚Р В°Р Р…Р С‘РЎвЂЎР ВµР Р…Р С‘Р Вµ Р Т‘Р В»Р С‘Р Р…РЎвЂ№ Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘РЎРЏ Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘<br /><small>Р вЂўРЎРѓР В»Р С‘ Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—РЎР‚Р ВµР Р†РЎвЂ№РЎв‚¬Р В°Р ВµРЎвЂљ РЎС“Р С”Р В°Р В·Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р С—РЎР‚Р ВµР Т‘Р ВµР В»РЎвЂ№, РЎвЂљР С• Р С•Р Р…Р С• Р В±РЎС“Р Т‘Р ВµРЎвЂљ РЎС“РЎР‚Р ВµР В·Р В°Р Р…Р С•<br />Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>100</b></small>', 'type' => 'input', 'value' => intval(extra_get_param($plugin, 'rss' . $i . '_maxlength')) ? extra_get_param($plugin, 'rss' . $i . '_maxlength') : '100'));
	array_push($cfgX, array('name' => 'rss' . $i . '_newslength', 'title' => 'Р С›Р С–РЎР‚Р В°Р Р…Р С‘РЎвЂЎР ВµР Р…Р С‘Р Вµ Р Т‘Р В»Р С‘Р Р…РЎвЂ№ Р С”Р С•РЎР‚Р С•РЎвЂљР С”Р С•Р в„– Р Р…Р С•Р Р†Р С•РЎРѓРЎвЂљР С‘<br /><small>Р вЂўРЎРѓР В»Р С‘ Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р Вµ Р С—РЎР‚Р ВµР Р†РЎвЂ№РЎв‚¬Р В°Р ВµРЎвЂљ РЎС“Р С”Р В°Р В·Р В°Р Р…Р Р…РЎвЂ№Р Вµ Р С—РЎР‚Р ВµР Т‘Р ВµР В»РЎвЂ№, РЎвЂљР С• Р С•Р Р…Р С• Р В±РЎС“Р Т‘Р ВµРЎвЂљ РЎС“РЎР‚Р ВµР В·Р В°Р Р…Р С•<br />Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>100</b></small>', 'type' => 'input', 'value' => intval(extra_get_param($plugin, 'rss' . $i . '_newslength')) ? extra_get_param($plugin, 'rss' . $i . '_newslength') : '100'));
	array_push($cfgX, array('name' => 'rss' . $i . '_content', 'title' => "Р вЂњР ВµР Р…Р ВµРЎР‚Р С‘РЎР‚Р С•Р Р†Р В°РЎвЂљРЎРЉ Р С—Р ВµРЎР‚Р ВµР С�Р ВµР Р…Р Р…РЎС“РЎР‹ {short_news}", 'type' => 'checkbox', value => extra_get_param($plugin, 'rss' . $i . '_content')));
	array_push($cfgX, array('name' => 'rss' . $i . '_img', 'title' => "Р Р€Р Т‘Р В°Р В»Р С‘РЎвЂљРЎРЉ Р Р†РЎРѓР Вµ Р С”Р В°РЎР‚РЎвЂљР С‘Р Р…Р С”Р С‘ Р С‘Р В· {short_news}", 'type' => 'checkbox', value => extra_get_param($plugin, 'rss' . $i . '_img')));
	array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р В±Р В»Р С•Р С”Р В° РІвЂћвЂ“ <b>' . $i . '</b> {rss' . $i . '}', 'entries' => $cfgX));
}
$cfgX = array();
array_push($cfgX, array('name' => 'localsource', 'title' => 'Р вЂ™РЎвЂ№Р В±Р ВµРЎР‚Р С‘РЎвЂљР Вµ Р С”Р В°РЎвЂљР В°Р В»Р С•Р С– Р С‘Р В· Р С”Р С•РЎвЂљР С•РЎР‚Р С•Р С–Р С• Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р Т‘Р В»РЎРЏ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ<br /><small><b>Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°</b> - Р С—Р В»Р В°Р С–Р С‘Р Р… Р В±РЎС“Р Т‘Р ВµРЎвЂљ Р С—РЎвЂ№РЎвЂљР В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†Р В·РЎРЏРЎвЂљРЎРЉ РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р С‘Р В· Р С•Р В±РЎвЂ°Р ВµР С–Р С• РЎв‚¬Р В°Р В±Р В»Р С•Р Р…Р В° РЎРѓР В°Р в„–РЎвЂљР В°; Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р Р…Р ВµР Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С•РЎРѓРЎвЂљР С‘ - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р Р†Р В·РЎРЏРЎвЂљРЎвЂ№ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°<br /><b>Р СџР В»Р В°Р С–Р С‘Р Р…</b> - РЎв‚¬Р В°Р В±Р В»Р С•Р Р…РЎвЂ№ Р В±РЎС“Р Т‘РЎС“РЎвЂљ Р В±РЎР‚Р В°РЎвЂљРЎРЉРЎРѓРЎРЏ Р С‘Р В· РЎРѓР С•Р В±РЎРѓРЎвЂљР Р†Р ВµР Р…Р Р…Р С•Р С–Р С• Р С”Р В°РЎвЂљР В°Р В»Р С•Р С–Р В° Р С—Р В»Р В°Р С–Р С‘Р Р…Р В°</small>', 'type' => 'select', 'values' => array('0' => 'Р РЃР В°Р В±Р В»Р С•Р Р… РЎРѓР В°Р в„–РЎвЂљР В°', '1' => 'Р СџР В»Р В°Р С–Р С‘Р Р…'), 'value' => intval(extra_get_param($plugin, 'localsource'))));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С•РЎвЂљР С•Р В±РЎР‚Р В°Р В¶Р ВµР Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
$cfgX = array();
array_push($cfgX, array('name' => 'cache', 'title' => 'Р пїЅРЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Т‘Р В°Р Р…Р Р…РЎвЂ№РЎвЂ¦<br /><small><b>Р вЂќР В°</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ<br /><b>Р СњР ВµРЎвЂљ</b> - Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘Р Вµ Р Р…Р Вµ Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ</small>', 'type' => 'select', 'values' => array('1' => 'Р вЂќР В°', '0' => 'Р СњР ВµРЎвЂљ'), 'value' => intval(extra_get_param($plugin, 'cache'))));
array_push($cfgX, array('name' => 'cacheExpire', 'title' => 'Р СџР ВµРЎР‚Р С‘Р С•Р Т‘ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р С”Р ВµРЎв‚¬Р В°<br /><small>(РЎвЂЎР ВµРЎР‚Р ВµР В· РЎРѓР С”Р С•Р В»РЎРЉР С”Р С• РЎРѓР ВµР С”РЎС“Р Р…Р Т‘ Р С—РЎР‚Р С•Р С‘РЎРѓРЎвЂ¦Р С•Р Т‘Р С‘РЎвЂљ Р С•Р В±Р Р…Р С•Р Р†Р В»Р ВµР Р…Р С‘Р Вµ Р С”Р ВµРЎв‚¬Р В°. Р вЂ”Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—Р С• РЎС“Р С�Р С•Р В»РЎвЂЎР В°Р Р…Р С‘РЎР‹: <b>60</b>)</small>', 'type' => 'input', 'value' => intval(extra_get_param($plugin, 'cacheExpire')) ? extra_get_param($plugin, 'cacheExpire') : '60'));
array_push($cfg, array('mode' => 'group', 'title' => '<b>Р СњР В°РЎРѓРЎвЂљРЎР‚Р С•Р в„–Р С”Р С‘ Р С”Р ВµРЎв‚¬Р С‘РЎР‚Р С•Р Р†Р В°Р Р…Р С‘РЎРЏ</b>', 'entries' => $cfgX));
// RUN 
if ($_REQUEST['action'] == 'commit') {
	// If submit requested, do config save
	commit_plugin_config_changes($plugin, $cfg);
	print_commit_complete($plugin);
} else {
	generate_config_page($plugin, $cfg);
}